gp2gp-translator/src/test/resources/xml/inbound_message_ebxml.xml

<SOAP:Envelope xmlns:xsi="http://www.w3c.org/2001/XML-Schema-Instance" xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" xmlns:hl7ebxml="urn:hl7-org:transport/ebxml/DSTUv1.0" xmlns:xlink="http://www.w3.org/1999/xlink">
    <SOAP:Header>
        <eb:MessageHeader SOAP:mustUnderstand="1" eb:version="2.0">
            <eb:From>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">RHM-801710</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">RHM-803229</eb:PartyId>
            </eb:To>
            <eb:CPAId>S2030731A2137919</eb:CPAId>
            <eb:ConversationId>6E242658-3D8E-11E3-A7DC-172BDA00FA67</eb:ConversationId>
            <eb:Service>urn:nhs:names:services:gp2gp</eb:Service>
            <eb:Action>RCMR_IN030000UK06</eb:Action>
            <eb:MessageData>
                <eb:MessageId>6E242658-3D8E-11E3-A7DC-172BDA00FA67</eb:MessageId>
                <eb:Timestamp>2013-10-25T16:59:29Z</eb:Timestamp>
            </eb:MessageData>
            <eb:DuplicateElimination/>
        </eb:MessageHeader>
        <eb:AckRequested SOAP:mustUnderstand="1" eb:version="2.0" eb:signed="false" SOAP:actor="urn:oasis:names:tc:ebxml-msg:actor:nextMSH"/>
    </SOAP:Header>
    <SOAP:Body>
        <eb:Manifest SOAP:mustUnderstand="1" eb:version="2.0">
            <eb:Reference xlink:href="cid:6e242659-3d8e-11e3-a7dc-172bda00fa67@spine.nhs.uk">
                <eb:Schema eb:location="http://www.nhsia.nhs.uk/schemas/HL7-Message.xsd" eb:version="1.0"/>
                <eb:Description xml:lang="en">HL7 payload</eb:Description>
                <hl7ebxml:Payload style="HL7" encoding="XML" version="3.0"/>
            </eb:Reference>
            <eb:Reference eb:id="1C135B3C-5AA5-4BF1-A08B-E6002455B806" xlink:href="mid:435B1171-31F6-4EF2-AD7F-C7E64EEFF357">
                <eb:Description xml:lang="en">
                    Filename="1C135B3C-5AA5-4BF1-A08B-E6002455B806_image.tif"
                    ContentType=image/tiff
                    Compressed=Yes
                    LargeAttachment=No
                    OriginalBase64=Yes
                </eb:Description>
            </eb:Reference>
            <eb:Reference eb:id="277F29F1-FEAB-4D38-8266-FEB7A1E6227D" xlink:href="cid:17C993E0-0302-4C3C-9608-7E4862193784">
                <eb:Description xml:lang="en">
                    Filename="277F29F1-FEAB-4D38-8266-FEB7A1E6227D_LICENSE.txt"
                    ContentType=text/plain
                    Compressed=No
                    LargeAttachment=No
                    OriginalBase64=Yes
                </eb:Description>
            </eb:Reference>
            <eb:Reference eb:id="7CCB6A77-360E-434E-8CF4-97C7C2B47D70" xlink:href="mid:E39E79A2-FA96-48FF-9373-7BBCB9D036E7">
                <eb:Description xml:lang="en">
                    Filename="7CCB6A77-360E-434E-8CF4-97C7C2B47D70_book.txt"
                    ContentType=text/plain
                    Compressed=No
                    LargeAttachment=Yes
                    OriginalBase64=Yes
                </eb:Description>
            </eb:Reference>
            <eb:Reference eb:id="8681AF4F-E577-4C8D-A2CE-43CABE3D5FB4" xlink:href="mid:A7B6C8EC-5AB4-4BF3-BB72-5D76E5D205A4">
                <eb:Description xml:lang="en">
                    Filename="8681AF4F-E577-4C8D-A2CE-43CABE3D5FB4_sample_mpeg4.mp4"
                    ContentType=video/mpeg
                    Compressed=No
                    LargeAttachment=No
                    OriginalBase64=Yes
                </eb:Description>
            </eb:Reference>
        </eb:Manifest>
    </SOAP:Body>
</SOAP:Envelope>